In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [2]:
obj = Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])

In [3]:
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [4]:
obj2 = obj.reindex(['a', 'b', 'c', 'd', 'e'])

In [5]:
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [6]:
obj.reindex(['a', 'b', 'c', 'd', 'e'], fill_value=0)

a   -5.3
b    7.2
c    3.6
d    4.5
e    0.0
dtype: float64

In [7]:
obj3 = Series(['blue', 'purple', 'yellow'], index=[0, 2, 4])
obj3.reindex(range(6), method='ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [8]:
frame = DataFrame(np.arange(9).reshape((3, 3)), index=[
                  'a', 'c', 'd'], columns=['Ohio', 'Texas', 'California'])
frame2 = frame.reindex(['a', 'b', 'c', 'd'])

In [9]:
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [10]:
states = ['Texas', 'Utah', 'California']
frame.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [11]:
frame.reindex(index=['a', 'b', 'c', 'd'],   columns=states)

   Texas  Utah  California
a    1.0   NaN         2.0
b    NaN   NaN         NaN
c    4.0   NaN         5.0
d    7.0   NaN         8.0

In [12]:
frame.ix[['a', 'b', 'c', 'd'],  states]

e:\python34\lib\site-packages\ipykernel\__main__.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#deprecate_ix
  if __name__ == '__main__':

   Texas  Utah  California
a    1.0   NaN         2.0
b    NaN   NaN         NaN
c    4.0   NaN         5.0
d    7.0   NaN         8.0

In [13]:
obj = Series(np.arange(5.), index=['a', 'b', 'c', 'd', 'e'])
new_obj = obj.drop('c')
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [14]:
obj.drop(['d', 'c'])

a    0.0
b    1.0
e    4.0
dtype: float64

In [15]:
data = DataFrame(np.arange(16).reshape((4, 4)),
                 index=['Ohio', 'Colorado', 'Utah', 'New York'],
                 columns=['one', 'two', 'three', 'four'])
data.drop(['Colorado', 'Ohio'])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [16]:
data.drop('two', axis=1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [17]:
data.drop(['two', 'four'], axis=1)

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

In [18]:
obj = Series(np.arange(4.), index=['a', 'b', 'c', 'd'])
obj['b']

1.0

In [19]:
obj[1]

1.0

In [20]:
obj[2:4]

c    2.0
d    3.0
dtype: float64

In [21]:
obj[['b', 'a', 'd']]

b    1.0
a    0.0
d    3.0
dtype: float64

In [22]:
obj[[1, 3]]

b    1.0
d    3.0
dtype: float64

In [23]:
obj[obj < 2]

a    0.0
b    1.0
dtype: float64

In [24]:
obj['b':'c']

b    1.0
c    2.0
dtype: float64

In [25]:
obj['b':'c'] = 5
obj

a    0.0
b    5.0
c    5.0
d    3.0
dtype: float64

In [26]:
obj

a    0.0
b    5.0
c    5.0
d    3.0
dtype: float64

In [27]:
data = DataFrame(np.arange(16).reshape((4, 4)),
                 index=['Ohio', 'Colorado', 'Utah', 'New York'],
                 columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [28]:
data['two']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int32

In [29]:
data[['three', 'one']]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

In [30]:
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [31]:
data[data['three'] > 5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [32]:
data < 5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [33]:
data[data < 5] = 0
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [34]:
data.ix['Colorado', ['two', 'three']]

e:\python34\lib\site-packages\ipykernel\__main__.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#deprecate_ix
  if __name__ == '__main__':

two      5
three    6
Name: Colorado, dtype: int32

In [35]:
data.ix[['Colorado', 'Utah'], [3, 0, 1]]

          four  one  two
Colorado     7    0    5
Utah        11    8    9

In [36]:
data.ix[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int32

In [37]:
data.ix[:'Utah', 'two']

Ohio        0
Colorado    5
Utah        9
Name: two, dtype: int32

In [38]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [39]:
data.ix[data.three > 5, :3]

          one  two  three
Colorado    0    5      6
Utah        8    9     10
New York   12   13     14

In [40]:
s1 = Series([7.3, -2.5, 3.4, 1.5], index=['a', 'b', 'c', 'd'])
s2 = Series([-2.1, 3.6, -1.5, 4, 3.1], index=['a', 'c', 'e', 'f', 'g'])
s1

a    7.3
b   -2.5
c    3.4
d    1.5
dtype: float64

In [41]:
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [42]:
s1 + s2

a    5.2
b    NaN
c    7.0
d    NaN
e    NaN
f    NaN
g    NaN
dtype: float64

In [43]:
df1 = DataFrame(np.arange(9.).reshape((3, 3)), columns=list(
    'bcd'), index=['Ohio', 'Texas', 'Colorado'])
df2 = DataFrame(np.arange(12.).reshape((4, 3)), columns=list(
    'bde'), index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [44]:
df1

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

In [45]:
df2

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [46]:
df1+df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

In [47]:
df1 = DataFrame(np.arange(12.).reshape((3, 4)), columns=list('abcd'))
df2 = DataFrame(np.arange(20.).reshape((4, 5)), columns=list('abcde'))

In [48]:
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [49]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   6.0   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [50]:
df1+df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0  11.0  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [51]:
df1.add(df2, fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0  11.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [52]:
df1.reindex(columns=df2.columns, fill_value=0)

     a    b     c     d  e
0  0.0  1.0   2.0   3.0  0
1  4.0  5.0   6.0   7.0  0
2  8.0  9.0  10.0  11.0  0

In [53]:
arr = np.arange(12.).reshape((3, 4))

In [54]:
arr

array([[  0.,   1.,   2.,   3.],
       [  4.,   5.,   6.,   7.],
       [  8.,   9.,  10.,  11.]])

In [55]:
arr[0]

array([ 0.,  1.,  2.,  3.])

In [56]:
arr - arr[0]

array([[ 0.,  0.,  0.,  0.],
       [ 4.,  4.,  4.,  4.],
       [ 8.,  8.,  8.,  8.]])

In [57]:
frame = DataFrame(np.arange(12.).reshape((4, 3)), columns=list(
    'bde'), index=['Utah', 'Ohio', 'Texas', 'Oregon'])
series = frame.ix[0]

e:\python34\lib\site-packages\ipykernel\__main__.py:3: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#deprecate_ix
  app.launch_new_instance()

In [58]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [59]:
series

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

In [60]:
frame - series

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

In [61]:
series2 = Series(range(3), index=['b', 'e', 'f'])
frame + series2

          b   d     e   f
Utah    0.0 NaN   3.0 NaN
Ohio    3.0 NaN   6.0 NaN
Texas   6.0 NaN   9.0 NaN
Oregon  9.0 NaN  12.0 NaN

In [62]:
series2

b    0
e    1
f    2
dtype: int32

In [63]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [64]:
series3 = frame['d']
frame.sub(series3, axis=0)

          b    d    e
Utah   -1.0  0.0  1.0
Ohio   -1.0  0.0  1.0
Texas  -1.0  0.0  1.0
Oregon -1.0  0.0  1.0

In [65]:
series3

Utah       1.0
Ohio       4.0
Texas      7.0
Oregon    10.0
Name: d, dtype: float64

In [66]:
frame = DataFrame(np.random.randn(4, 3), columns=list(
    'bde'), index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [67]:
frame

               b         d         e
Utah    1.044711  0.564931 -0.609535
Ohio    0.617399 -0.266087  0.019385
Texas  -0.032639  0.958011 -0.637445
Oregon  0.167550 -1.274877  0.222520

In [68]:
np.abs(frame)

               b         d         e
Utah    1.044711  0.564931  0.609535
Ohio    0.617399  0.266087  0.019385
Texas   0.032639  0.958011  0.637445
Oregon  0.167550  1.274877  0.222520

In [69]:
obj = Series(np.arange(4.), index=['d', 'a', 'b', 'c'])
obj.sort_index()

a    1.0
b    2.0
c    3.0
d    0.0
dtype: float64

In [70]:
obj

d    0.0
a    1.0
b    2.0
c    3.0
dtype: float64

In [71]:
frame = DataFrame(np.arange(8).reshape((2, 4)), columns=list(
    'dabc'), index=['three', 'one'])

In [72]:
frame

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [73]:
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [74]:
frame.sort_index(axis=1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [75]:
frame.sort_index(axis=1, ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [76]:
obj = Series([4, 7, -3, 2])

In [77]:
obj

0    4
1    7
2   -3
3    2
dtype: int64

In [78]:
obj.sort_values()

2   -3
3    2
0    4
1    7
dtype: int64

In [79]:
obj = Series([4, np.nan, 7, np.nan, -3, 2])
obj.sort_values()

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

In [80]:
frame = DataFrame({'b': [4, 7, -3, -2], 'a': [0, 1, 0, 1]})

In [81]:
frame

   a  b
0  0  4
1  1  7
2  0 -3
3  1 -2

In [82]:
frame.sort_index(by='b')

e:\python34\lib\site-packages\ipykernel\__main__.py:1: FutureWarning: by argument to sort_index is deprecated, pls use .sort_values(by=...)
  if __name__ == '__main__':

   a  b
2  0 -3
3  1 -2
0  0  4
1  1  7

In [83]:
frame.sort_values(by='b')

   a  b
2  0 -3
3  1 -2
0  0  4
1  1  7

In [84]:
frame.sort_values(by=['a', 'b'])

   a  b
2  0 -3
0  0  4
3  1 -2
1  1  7

In [85]:
obj = Series([7, -5, 7, 4, 2, 0, 4])
obj

0    7
1   -5
2    7
3    4
4    2
5    0
6    4
dtype: int64

In [86]:
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [87]:
obj.rank(method='first')

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [88]:
obj.rank(ascending=False, method='max')

0    2.0
1    7.0
2    2.0
3    4.0
4    5.0
5    6.0
6    4.0
dtype: float64

In [89]:
frame = DataFrame(
    {'b': [4.3, 7, -3, -2], 'a': [0, 1, 0, 1], 'c': [-2, 5, 8, -2.5]})

In [90]:
frame

   a    b    c
0  0  4.3 -2.0
1  1  7.0  5.0
2  0 -3.0  8.0
3  1 -2.0 -2.5

In [91]:
frame.rank(axis=1)

     a    b    c
0  2.0  3.0  1.0
1  1.0  3.0  2.0
2  2.0  1.0  3.0
3  3.0  2.0  1.0

In [92]:
obj = Series(range(5), index=['a', 'a', 'b', 'b', 'c'])

In [93]:
obj

a    0
a    1
b    2
b    3
c    4
dtype: int32

In [94]:
obj['a']

a    0
a    1
dtype: int32

In [95]:
df = DataFrame([[1.4, np.nan], [7.1, -4.5], [np.nan, np.nan],
                [0.75, -1.3]], index=['a', 'b', 'c', 'd'],
               columns=['one', 'two'])

In [96]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [97]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [98]:
df.sum(axis=1)

a    1.40
b    2.60
c     NaN
d   -0.55
dtype: float64

In [99]:
df.mean(axis=1, skipna=False)

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

In [100]:
df.idxmax()

one    b
two    d
dtype: object

In [101]:
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [102]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [103]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [105]:
obj = Series(['a', 'a', 'b', 'c'] * 4)
obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object

In [106]:
obj

0     a
1     a
2     b
3     c
4     a
5     a
6     b
7     c
8     a
9     a
10    b
11    c
12    a
13    a
14    b
15    c
dtype: object

In [111]:
from pandas_datareader import data

In [135]:
all_data = {}
for ticker in ['AAPL', 'IBM', 'MSFT', 'GOOG']:
    all_data[ticker] = data.get_data_yahoo(ticker, '1/1/2000', '1/1/2010')

In [142]:
price = DataFrame({tic: data['Adj Close'] for tic, data in all_data.items()})
volume = DataFrame({tic: data['Volume'] for tic, data in all_data.items()})

In [143]:
returns = price.pct_change()
returns.tail()

                AAPL      GOOG       IBM      MSFT
Date
2009-12-24  0.034340  0.011117  0.004384  0.002587
2009-12-28  0.012294  0.007098  0.013326  0.005484
2009-12-29 -0.011861 -0.005571 -0.003477  0.007058
2009-12-30  0.012147  0.005376  0.005461 -0.013699
2009-12-31 -0.004300 -0.004416 -0.012597 -0.015504

In [144]:
returns.MSFT.corr(returns.IBM)

0.49598006790672344

In [145]:
returns.MSFT.cov(returns.IBM)

0.00021595768182070384

In [146]:
returns.corr()

          AAPL      GOOG       IBM      MSFT
AAPL  1.000000  0.470676  0.410012  0.424305
GOOG  0.470676  1.000000  0.390689  0.443587
IBM   0.410012  0.390689  1.000000  0.495980
MSFT  0.424305  0.443587  0.495980  1.000000

In [147]:
returns.cov()

          AAPL      GOOG       IBM      MSFT
AAPL  0.001027  0.000303  0.000252  0.000309
GOOG  0.000303  0.000580  0.000142  0.000205
IBM   0.000252  0.000142  0.000367  0.000216
MSFT  0.000309  0.000205  0.000216  0.000516

In [148]:
obj = Series(['c', 'a', 'd', 'a', 'a', 'b', 'b', 'c', 'c'])
uniques = obj.unique()

In [149]:
uniques

array(['c', 'a', 'd', 'b'], dtype=object)

In [150]:
obj.value_counts()

c    3
a    3
b    2
d    1
dtype: int64

In [151]:
pd.value_counts(obj.values, sort=False)

a    3
d    1
c    3
b    2
dtype: int64

In [154]:
mask=obj.isin(['b', 'c'])

In [155]:
obj[mask]

0    c
5    b
6    b
7    c
8    c
dtype: object

In [156]:
data = DataFrame({'Qu1': [1, 3, 4, 3, 4],
                  'Qu2': [2, 3, 1, 2, 3],
                  'Qu3': [1, 5, 2, 4, 4]})

In [157]:
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [158]:
data.apply(pd.value_counts).fillna(0)

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

In [160]:
string_data = Series(['aardvark', 'artichoke', np.nan, 'avocado'])

In [161]:
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [162]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [163]:
from numpy import nan as NA

In [164]:
data = Series([1, NA, 3.5, NA, 7])
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [165]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [167]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [169]:
data = DataFrame([[1, 6.5, 3], [1, NA, NA], [NA, NA, NA], [NA, 6.5, 3]])
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [170]:
data.dropna()

     0    1    2
0  1.0  6.5  3.0

In [171]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [172]:
data[4] = NA
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [173]:
data.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [174]:
df = DataFrame(np.random.randn(7, 3))
df

          0         1         2
0  0.639875 -0.018617 -0.648781
1 -1.608992  0.320033  1.422819
2  0.286581 -0.977018  1.741866
3 -1.247026 -0.275243  1.080590
4  0.577560  0.463672  0.156348
5 -2.359493 -0.600046 -0.472006
6 -0.624602  1.632171 -0.492269

In [175]:
df.ix[:4, 1] = NA
df.ix[:2, 2] = NA

e:\python34\lib\site-packages\ipykernel\__main__.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#deprecate_ix
  if __name__ == '__main__':

In [176]:
df

          0         1         2
0  0.639875       NaN       NaN
1 -1.608992       NaN       NaN
2  0.286581       NaN       NaN
3 -1.247026       NaN  1.080590
4  0.577560       NaN  0.156348
5 -2.359493 -0.600046 -0.472006
6 -0.624602  1.632171 -0.492269

In [177]:
df.dropna(thresh=3)

          0         1         2
5 -2.359493 -0.600046 -0.472006
6 -0.624602  1.632171 -0.492269

In [178]:
df.fillna(0)

          0         1         2
0  0.639875  0.000000  0.000000
1 -1.608992  0.000000  0.000000
2  0.286581  0.000000  0.000000
3 -1.247026  0.000000  1.080590
4  0.577560  0.000000  0.156348
5 -2.359493 -0.600046 -0.472006
6 -0.624602  1.632171 -0.492269

In [179]:
df.fillna({1:0.5})

          0         1         2
0  0.639875  0.500000       NaN
1 -1.608992  0.500000       NaN
2  0.286581  0.500000       NaN
3 -1.247026  0.500000  1.080590
4  0.577560  0.500000  0.156348
5 -2.359493 -0.600046 -0.472006
6 -0.624602  1.632171 -0.492269

In [180]:
data = Series(np.random.randn(10),
              index=[['a', 'a', 'a', 'b', 'b', 'b', 'c', 'c', 'd', 'd'],
                     [1, 2, 3, 1, 2, 3, 1, 2, 2, 3]])

In [181]:
data

a  1    0.249827
   2    0.548495
   3    1.170482
b  1   -0.275464
   2   -0.123018
   3    0.318089
c  1   -0.424821
   2    1.203024
d  2   -1.207407
   3    1.133782
dtype: float64

In [182]:
data.index

MultiIndex(levels=[['a', 'b', 'c', 'd'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1, 2, 2, 3, 3], [0, 1, 2, 0, 1, 2, 0, 1, 1, 2]])

In [183]:
data['b']

1   -0.275464
2   -0.123018
3    0.318089
dtype: float64

In [184]:
data[:,2]

a    0.548495
b   -0.123018
c    1.203024
d   -1.207407
dtype: float64

In [185]:
data.unstack()

          1         2         3
a  0.249827  0.548495  1.170482
b -0.275464 -0.123018  0.318089
c -0.424821  1.203024       NaN
d       NaN -1.207407  1.133782

In [186]:
data.unstack().stack()

a  1    0.249827
   2    0.548495
   3    1.170482
b  1   -0.275464
   2   -0.123018
   3    0.318089
c  1   -0.424821
   2    1.203024
d  2   -1.207407
   3    1.133782
dtype: float64

In [190]:
frame = DataFrame(np.arange(12).reshape((4, 3)),
                  index=[['a', 'a', 'b', 'b'], [1, 2, 1, 2]],
                  columns=[['Ohio', 'Ohio', 'Colorado'], ['Green', 'Red', 'Green']])

In [191]:
frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [192]:
frame.index.names = ['key1', 'key2']
frame.columns.names = ['state', 'color']

In [193]:
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [195]:
frame['Ohio']

color      Green  Red
key1 key2
a    1         0    1
     2         3    4
b    1         6    7
     2         9   10

In [196]:
frame.swaplevel('key1', 'key2')

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

In [197]:
frame.sortlevel(1)

e:\python34\lib\site-packages\ipykernel\__main__.py:1: FutureWarning: sortlevel is deprecated, use sort_index(level= ...)
  if __name__ == '__main__':

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
b    1        6   7        8
a    2        3   4        5
b    2        9  10       11

In [198]:
frame.sum(level='key2')

state  Ohio     Colorado
color Green Red    Green
key2
1         6   8       10
2        12  14       16

In [199]:
frame.sum(level='color', axis=1)

color      Green  Red
key1 key2
a    1         2    1
     2         8    4
b    1        14    7
     2        20   10